{
  "backend/main.mo": "Main backend actor implementing a creative content marketplace with types and state for content management, purchases, user profiles, DTF gallery, licensing/royalty tracking, admin dashboard metrics, creative studio tools (coloring pages, affirmations, memes), and integration with AccessControl, UserApproval, Stripe, Storage, and OutCall modules.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features (admin dashboard management, licensing/royalty automation, and Stripe checkout integration) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with TanStack Router setup, useQueries.ts with React Query hooks for all backend operations, enhanced UI components with animations, marketplace/dashboard/purchases pages, creative studio tools, and comprehensive CSS with animations and accessibility features.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Creative Content Creation and Monetization Platform.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router configuration for all routes (marketplace, creator dashboard, creative studio, DTF gallery, admin, legal pages), ThemeProvider, authentication-aware layout with Header/Footer, ProfileSetupModal for first-time users, and StripeSetupModal.",
  "frontend/src/components/AdminUploadContentModal.tsx": "Admin modal for uploading creative content with form fields (title, category, description, preview, price), file upload with progress tracking, and integrated licensing consent workflow that triggers LicensingConsentModal after successful upload.",
  "frontend/src/components/AffirmationCreator.tsx": "Creative studio component for generating mood-based or custom affirmations with predefined templates, AI-style generation simulation, preview display, and save functionality to user's creations using backend mutations.",
  "frontend/src/components/AnimatedButton.tsx": "A reusable button component with optional tooltip and configurable animation types (lift, glow, scale, pulse, none). Wraps the base Button component with animation classes and TooltipProvider.",
  "frontend/src/components/ColoringPageGenerator.tsx": "Component for generating AI coloring pages with theme and difficulty selectors. Includes functionality to generate, save to backend, and download coloring pages with simulated generation delay.",
  "frontend/src/components/ContentCard.tsx": "Displays a creative content item as a card with title, description, category badge, price, and engagement metrics (likes/shares). Includes hover animations and navigation to content detail page.",
  "frontend/src/components/CreateKingsCollabModal.tsx": "Empty file with no content.",
  "frontend/src/components/EmbedWidget.tsx": "Widget component that detects iframe embedding and displays simplified content for DTF gallery, shop preview, or promotional widgets. Shows a link to open the full site when embedded.",
  "frontend/src/components/Footer.tsx": "Application footer with social media links (Facebook, Instagram, TikTok, YouTube), legal page navigation (terms, privacy, refund, copyright), and Caffeine.ai attribution. Includes hover animations on all interactive elements.",
  "frontend/src/components/Header.tsx": "Main navigation header with responsive design, Internet Identity authentication, desktop/mobile navigation menus, and admin-specific links. Includes active route highlighting and tooltips for navigation items.",
  "frontend/src/components/LicensingBadge.tsx": "Displays licensing information badges for content including commercial use, derivative works, redistribution rights, and contributor count. Fetches licensing summary from backend and shows tooltips with detailed explanations.",
  "frontend/src/components/LicensingConsentModal.tsx": "Modal component for creators to configure licensing agreements including ownership confirmation, redistribution rights, commercial use, derivative works, and royalty splits with collaborators.",
  "frontend/src/components/MemeCreator.tsx": "Interactive meme creation tool with canvas-based text overlay, font selection, template backgrounds, AI generation placeholder, and save functionality to backend.",
  "frontend/src/components/OnboardingTooltip.tsx": "Reusable tooltip component that displays onboarding hints once per feature using localStorage to track dismissal state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to create their profile with name and bio fields, blocking dismissal until profile is created.",
  "frontend/src/components/RecommendationEngine.tsx": "Content recommendation system that scores and suggests content based on category, price, creator similarity, recency, and user purchase history.",
  "frontend/src/components/SEOHead.tsx": "Component that dynamically updates document meta tags, Open Graph properties, Twitter cards, canonical links, and structured data for SEO optimization.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe payment integration with secret key input, country allowlist, and live/test key detection with warnings.",
  "frontend/src/components/UploadContentModal.tsx": "Modal component for uploading creative content with form fields for title, category, description, preview, price, and file upload. Handles content upload and triggers a licensing consent modal after successful upload.",
  "frontend/src/components/UploadDtfModal.tsx": "Modal component for uploading DTF (Direct-to-Film) designs with fields for title, artist, tags, external links, pricing, and preview images. Supports multiple content types including free downloads, purchases, and external redirects.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state. Automatically creates authenticated or anonymous actors and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration. Provides authentication status and identity object to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including user profiles, content management (upload/update/delete/search), purchases, creator summaries, and various content types (coloring pages, affirmations, memes, DTF designs). Handles query caching and invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and keyframe animations for UI effects (fade-in, slide, zoom, button pulse/bounce/shimmer). Defines color schemes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context, then renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with company story, mission, features, values, and social media links. Uses cards and icons to present information about Righteous Truths platform for creators.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for overview metrics, licensing requests, user management, content management, and system settings. Includes approval/rejection workflows, content deletion, search/filter functionality, and admin-only access control.",
  "frontend/src/pages/ColoringBookBuilderPage.tsx": "Allows authenticated users to select multiple coloring pages from their creative content, arrange them in order, customize line thickness, and export as a PDF. Includes page management with add/remove/reorder functionality.",
  "frontend/src/pages/CommunityPage.tsx": "Community content browsing page with tabs for affirmations, poems, and music. Displays sample content in cards with search functionality and SEO optimization.",
  "frontend/src/pages/ContentDetailPage.tsx": "Displays detailed view of marketplace content including title, description, price, creator info, and licensing details. Handles purchase flow via Stripe checkout session creation with SEO structured data.",
  "frontend/src/pages/CreativeStudioPage.tsx": "Creative Studio page with tabs for coloring page generation, affirmation creation, meme creation, and DTF artwork tools. Requires user authentication via Internet Identity.",
  "frontend/src/pages/CreatorDashboardPage.tsx": "Creator dashboard displaying analytics (sales, revenue charts), content management, and purchase history. Shows mock analytics data with charts using recharts library.",
  "frontend/src/pages/CreatorProfilePage.tsx": "Public creator profile page showing creator stats (items, sales, revenue) and their uploaded content. Fetches profile data and filters content by creator ID.",
  "frontend/src/pages/DtfGalleryPage.tsx": "DTF (Direct-to-Film) design gallery with search, filtering by content type (purchase/free/external), and actions for download, share, and upload. Displays designs in a card grid layout.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, daily affirmation card, and navigation to store/marketplace. Features animated elements and platform branding with logo.",
  "frontend/src/pages/KingsCollaborationPage.tsx": "File appears to be empty or truncated with no visible content.",
  "frontend/src/pages/LegalCopyrightPage.tsx": "Displays the copyright and licensing notice page explaining creator rights retention, licensing framework (redistribution, commercial use, derivative works), and content usage terms. Uses Card, ScrollArea, and Separator components to present legal information in a scrollable format.",
  "frontend/src/pages/LegalPrivacyPage.tsx": "Renders the privacy policy page detailing data collection practices, usage data, and privacy protections with GDPR/CCPA compliance. Features icons from lucide-react and structured sections within a scrollable card layout.",
  "frontend/src/pages/LegalRefundPage.tsx": "Presents the refund policy page explaining digital content purchase terms, refund eligibility criteria (technical issues, misrepresentation, duplicate purchases), and the final sale policy. Displays content in a scrollable card with structured sections.",
  "frontend/src/pages/LegalTermsPage.tsx": "Shows the terms of service page covering acceptance of terms, user accounts/authentication via Internet Identity, content ownership, and intellectual property rights. Uses a scrollable card layout to present legal terms in organized sections.",
  "frontend/src/pages/MarketplacePage.tsx": "Main marketplace page with search and category filtering for browsing content, displaying popular creators, and showing personalized recommendations. Includes hero banner, search functionality, content cards, and onboarding tooltips with SEO optimization.",
  "frontend/src/pages/MyCreationsPage.tsx": "Displays a user's AI-generated creations (coloring pages, memes, greeting cards) organized in tabs with download and social media sharing functionality. Requires authentication via Internet Identity.",
  "frontend/src/pages/MyPurchasesPage.tsx": "Shows authenticated users their purchased content with download capabilities and licensing information including commercial use rights and royalty split details.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple error page displayed when a payment is cancelled or fails, with a button to return to the marketplace.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles post-payment processing by confirming the Stripe session, recording the purchase with royalty splits, and displaying success or error states with download options.",
  "frontend/src/pages/ProductionChecklistPage.tsx": "Admin diagnostic page that checks production readiness including Internet Identity, Stripe configuration, SSL, SEO meta tags, legal pages, and provides embed code generation for content integration.",
  "frontend/src/pages/StorePage.tsx": "Digital marketplace page with search functionality displaying purchasable content and DTF materials organized in tabs (all products, digital art, DTF materials).",
  "frontend/src/pages/VoicesOfKingsPage.tsx": "Empty file with no content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting Righteous Truths platform architecture with AI creative tools, DTF gallery/store, admin dashboard, licensing/royalty automation, Stripe integration, and tracking pending verification tasks for production readiness."
}